/***** GisKmlToMap.h **********  Belenkov O.V.  ******* 14/06/12 ****
*                                                                  *
*               Copyright (c) PANORAMA Group 1991-2012             *
*                      All Rights Reserved                         *
*                                                                  *
********************************************************************
*                                                                  *
*                           FOR  WINDOWS         		   *
*                                                                  *
********************************************************************
*                                                                  *
*                 Конвертор из KML в Панораму                      *
*                                                                  *
*******************************************************************/

#ifndef GISKMLTOMAP_H
#define GISKMLTOMAP_H

#ifndef MAPTYPE_H
  #include "maptype.h"
#endif

extern "C"
{

// --------------------------------------------------------------
// Импорт данных из формата KML в формат ГИС Панорама
// Имя импортируемого файла KML и имя создаваемой карты выбирается в диалоге
// hmap - идентификатор открытых данных или 0
// parm - служебная структура с идентификатором главного окна приложения
// mapname - указатель на буфер для записи имени созданной карты
// size    - размер буфера в байтах
// При ошибке возвращает ноль
// --------------------------------------------------------------

_MAPIMP long int WINAPI LoadKmlToMap(HMAP hmap, TASKPARMEX * parm, 
                                     char * mapname, int size);


}

#endif  // GISKMLTOMAP_H

